from django.shortcuts import render, redirect
from django.http import HttpResponse
from .forms import ThQuestionForm
from .models import ThQuestion

# Create your views here.

def instruction(request):
    return render(request, 'thq/th-instruction.html')

def question(request):
    if request.method == 'POST':
        form = ThQuestionForm(request.POST)
        form.save()
        return redirect('th-instruction')

    else:
        provinces = [
            'กระบี่', 'กรุงเทพมหานคร', 'กาญจนบุรี', 'กาฬสินธุ์', 'กำแพงเพชร', 'ขอนแก่น', 'จันทบุรี', 'ฉะเชิงเทรา',
            'ชลบุรี', 'ชัยนาท', 'ชัยภูมิ', 'ชุมพร', 'เชียงราย', 'เชียงใหม่', 'ตรัง', 'ตราด', 'ตาก', 'นครนายก',
            'นครปฐม', 'นครพนม', 'นครราชสีมา', 'นครศรีธรรมราช', 'นครสวรรค์', 'นนทบุรี', 'นราธิวาส', 'น่าน',
            'บึงกาฬ', 'บุรีรัมย์', 'ปทุมธานี', 'ประจวบคีรีขันธ์', 'ปราจีนบุรี', 'ปัตตานี', 'พระนครศรีอยุธยา', 'พะเยา',
            'พังงา', 'พัทลุง', 'พิจิตร', 'พิษณุโลก', 'เพชรบุรี', 'เพชรบูรณ์', 'แพร่', 'ภูเก็ต', 'มหาสารคาม',
            'มุกดาหาร', 'แม่ฮ่องสอน', 'ยโสธร', 'ยะลา', 'ร้อยเอ็ด', 'ระนอง', 'ระยอง', 'ราชบุรี', 'ลพบุรี',
            'ลำปาง', 'ลำพูน', 'เลย', 'ศรีสะเกษ', 'สกลนคร', 'สงขลา', 'สตูล', 'สมุทรปราการ', 'สมุทรสงคราม',
            'สมุทรสาคร', 'สระแก้ว', 'สระบุรี', 'สิงห์บุรี', 'สุโขทัย', 'สุพรรณบุรี', 'สุราษฎร์ธานี', 'สุรินทร์',
            'หนองคาย', 'หนองบัวลำภู', 'อ่างทอง', 'อำนาจเจริญ', 'อุดรธานี', 'อุตรดิตถ์', 'อุทัยธานี', 'อุบลราชธานี'
        ]
        transport_modes = [
            'สายการบิน full-service', 'สายการบิน low cost', 'รถไฟ', 'รถไฟฟ้า/รถไฟใต้ดิน',
            'รถโดยสาร (รถทัวร์) ประจําทาง', 'รถโดยสารประจําทาง (รถเมล์)', 'รถตู้โดยสารประจําทาง',
            'รถสองแถวประจําทาง', 'รถกระป๊อ', 'เรือโดยสาร', 'รถโดยสาร (รถทัวร์) รับจ้าง/ไม่ประจําทาง',
            'รถตู้โดยสารรับจ้าง/ไม่ประจําทาง', 'รถแท็กซี่', 'รถตุ๊กตุ๊ก/สกายแลป', 'จักรยานยนต์รับจ้าง',
            'รถเช่าขับเอง (รถยนต์ รถตู้)', 'รถจักรยานยนต์เช่าขับเอง', 'รถส่วนตัว (รถยนต์ รถตู้)',
            'รถจักรยานยนต์ส่วนตัว', 'จักรยาน', 'เดินเท้า'
        ]
        reasons = [
            'ไม่มีทางเลือก', 'ค่าใช้จ่ายถูก', 'ความปลอดภัย', 'ความสะดวก', 'ความรวดเร็ว',
            'คาดการณ์เวลาได้ง่าย', 'บรรยากาศและสุนทรียภาพ'
        ]
        factors = {
            'ความสวยงามของแหล่งท่องเที่ยว': '1',
            'ความปลอดภัยของแหล่งท่องเที่ยว': '2',
            'ความสะดวกในการเดินทาง': '3',
            'ความพร้อมของสิ่งอำนวยความสะดวก': '4',
            'เป็นแหล่งท่องเที่ยวเดิมที่เคยไปแล้วประทับใจ': '5',
            'เป็นแหล่งท่องเที่ยวใหม่ที่ไม่เคยไปมาก่อน': '6',
            'มีกิจกรรมให้ทำหลากหลาย': '7',
            'จากคำแนะนำของคนรู้จัก': '8',
            'การโฆษณาแหล่งท่องเที่ยวตามสื่อต่างๆ': '9',
            'การส่งเสริมการขาย เช่น โปรโมชั่น แพ็คเกจ': '10'
        }
        questions1 = {
            'ด้านการขนส่ง (Transportation)': {
                'th_q1': '1. ความสะดวกในการเดินทางไปยังสถานที่ท่องเที่ยวที่ต้องการ',
                'th_q2': '2. การกำหนดเวลาในการท่องเที่ยว (สามารถคาดการณ์ระยะเวลาเดินทางให้เป็นไปตามแผนที่วางไว้ตรงตามตารางเวลา)',
                'th_q3': '3. สิ่งอำนวยความสะดวกในการเดินทางท่องเที่ยว (เครื่องปรับอากาศภายในรถ ที่ชาร์จไฟ เบาะปรับเอนได้อุปกรณ์สำหรับผู้พิการ)',
                'th_q4': '4. ค่าใช้จ่ายในการเดินทางเหมาะสม (ค่าโดยสาร ค่าเช่ารถ ค่าน้ำมัน ฯลฯ)'
            },
            'ด้านโครงสร้างพื้นฐาน (Infrastructure)': {
                'th_q5': '5. จุดจอดรถ จุดพักรถ ในระหว่างการเดินทางมายังสถานที่ท่องเที่ยวมีเพียงพอและเหมาะสม (จุดแวะพัก สถานีบริการน้ำมัน ร้านขายของฝากขนาดใหญ่ สถานีขนส่งสาธารณะ)',
                'th_q6': '6. ระบบสื่อสารที่มีคุณภาพและครอบคลุมในการเดินทางและแหล่งท่องเที่ยว (สัญญาณ Wi-Fi สัญญาณมือถือ 3G หรือ 4G)',
                'th_q7': '7. ถนนและสถานีขนส่งสาธารณะ (สถานีรถไฟ สถานีขนส่ง ท่าเรือ และสนามบิน)มีความพร้อมและเพียงพอในการรองรับนักท่องเที่ยว',
                'th_q8': '8. ป้ายบอกทางและป้ายเตือนในเส้นทางการท่องเที่ยวมีความชัดเจน สังเกตเห็นได้ง่าย'
            },
            'ด้านข้อมูลข่าวสาร (Information)': {
                'th_q9': '9. มีศูนย์ข้อมูลนักท่องเที่ยวหรือบอร์ดแจ้งข่าวประชาสัมพันธ์ที่ให้คำแนะนำข้อมูลการท่องเที่ยวได้อย่างถูกต้อง ชัดเจน และเพียงพอในพื้นที่',
                'th_q10': '10. มีแหล่งข้อมูลสำหรับแนะนำแหล่งท่องเที่ยว มีการนำเสนอข้อมูลที่ถูกต้อง ครอบคลุมและมีความทันสมัย สามารถตอบสนองในการวางแผนการท่องเที่ยวได้',
                'th_q11': '11. มีแหล่งข้อมูลที่สามารถให้ข้อมูลการเดินทาง (อัตราค่าโดยสาร ตารางเวลาให้บริการ และระยะเวลาเดินทาง เป็นต้น) ไปยังแหล่งท่องเที่ยวได้อย่างถูกต้องชัดเจน (สำหรับการวางแผนการเดินทางท่องเที่ยว)'
            },
            'ด้านการเงิน (Finance)': {
                'th_q12': '12. ทางเลือกในการชำระสินค้าและบริการ ค่าโดยสาร ระหว่างการท่องเที่ยวมีความหลากหลายและสะดวก (บริการอินเตอร์เน็ตแบงค์กิ้ง บัตรเครดิต บัตรเดบิต)',
                'th_q13': '13. การยกเลิก เปลี่ยน และการขอคืนเงินสินค้าและบริการ สามารถทำได้สะดวกและรวดเร็ว (ยกเลิกเที่ยวบิน เปลี่ยนตั๋วรถ ยกเลิกโรงแรม)',
                'th_q14': '14. ค่าธรรมเนียมในการใช้บริการของสถานที่ท่องเที่ยวมีความเหมาะสม',
            },
            'ด้านความปลอดภัย (Safety)': {
                'th_q15': '15. ความพร้อมของอุปกรณ์ป้องกันอุบัติเหตุระหว่างการเดินทางท่องเที่ยว (เข็มขัดนิรภัย ป้ายเตือนบนถนน)',
                'th_q16': '16. สถานที่และช่องทางในการแจ้งเหตุด่วนเหตุร้าย (สถานีตำรวจ Call center) ในการเดินทางและในบริเวณแหล่งท่องเที่ยวมีเพียงพอ',
                'th_q17': '17. การให้บริการในสถานที่ท่องเที่ยวมีมาตรการในการรักษาความปลอดภัย (ชูชีพ ระบบการรักษาความปลอดภัยให้แก่นักท่องเที่ยว)'
            },
            'ด้านการเข้าถึง (Access)': {
                'th_q18': '18. สถานที่ท่องเที่ยวสามารถเดินทางเข้าถึงได้สะดวก (ถนนไม่ขรุขระหรือชำรุด ไม่ห่างจากถนนเส้นหลัก)',
                'th_q19': '19. เส้นทางในการเข้าถึงสถานที่ท่องเที่ยวมีหลายเส้นทาง',
                'th_q20': '20. รูปแบบการเดินทางเพื่อเข้าถึงสถานที่ท่องเที่ยวมีหลายทางเลือก (รถประจำทาง รถเช่า รถส่วนตัว รถบริการ)'
            }
        }
        questions2 = {
            'ความไว้วางใจ (Trust)': {
                'th_q21': '21. ท่านรู้สึกไว้วางใจกับการบริการการท่องเที่ยวในครั้งนี้',
                'th_q22': '22. พนักงานบริการมีความซื่อสัตย์ น่าเชื่อถือ',
                'th_q23': '23. ท่านรู้สึกเชื่อมั่นการให้บริการแหล่งท่องเที่ยวในครั้งนี้',
            },
            'ความผูกพัน (Commitment)': {
                'th_q24': '24. ท่านรู้สึกอยากกลับมาเที่ยวอีกครั้ง',
                'th_q25': '25. ท่านรู้สึกภูมิใจที่ได้มาท่องเที่ยวแห่งนี้',
                'th_q26': '26. ท่านรู้สึกผ่อนคลายและเพลิดเพลินขณะที่ท่องเที่ยว',
                'th_q27': '27. แหล่งท่องเที่ยวมีคุณค่าและมีความสำคัญ'
            },
            'ความพึงพอใจ (Satisfaction)': {
                'th_q28': '28. ภาพรวมท่านมีความพึงพอใจในการท่องเที่ยวและใช้บริการที่นี่',
                'th_q29': '29. ประสบการณ์การท่องเที่ยวที่นี่ตรงกับความคาดหวังของท่าน',
                'th_q30': '30. มีความสุขกับการท่องเที่ยวครั้งนี้'
            },
            'ความภักดี (Loyalty)': {
                'th_q31': '31. ท่านจะกลับมาท่องเที่ยวที่นี่อีกครั้ง',
                'th_q32': '32. ท่านจะแนะนำ เพื่อนสนิท/ญาติพี่น้อง/คนรัก ให้มาท่องเที่ยวที่นี่',
                'th_q33': '33. หากค่าใช้จ่ายท่องเที่ยวเพิ่มขึ้น ท่านยินดีที่จะเต็มใจจ่ายในการกลับมาเที่ยวที่นี่'
            }
        }
        ranks = {
                    'มากที่สุด': '5',
                    'มาก': '4',
                    'ปานกลาง': '3',
                    'น้อย': '2',
                    'น้อยที่สุด': '1'
        }

        context = {
            'provinces': provinces,
            'transport_modes': transport_modes,
            'reasons': reasons,
            'factors': factors,
            'ranks': ranks,
            'questions1': questions1,
            'questions2': questions2
        }
        return render(request, 'thq/th-question.html', context)
